<?php 

	//$existingNames = array("Daniel", "Denis", "Danny", "Danielio" );

	$existingNames = array(
    "Александр",
    "Иван",
    "Максим",
    "Даниил",
    "Михаил",
    "Егор",
    "Илья",
    "Дмитрий",
    "Роман",
    "Тимофей",
    "Кирилл",
    "Матвей",
    "Ярослав",
    "Никита",
    "Алексей",
    "Артем",
    "Константин",
    "Лев",
    "Николай",
    "Степан",
    "Сергей",
    "Владимир",
    "Тимур",
    "Андрей",
    "Евгений",
    "Павел",
    "Марк",
    "Владислав",
    "Денис",
    "Арсений",
    "Федор",
    "Макар",
    "Платон",
    "Вячеслав",
    "Давид",
    "Мирон",
    "Богдан",
    "Савелий",
    "Игорь",
    "Глеб",
    "Юрий",
    "Захар",
    "Георгий",
    "Виктор",
    "Семен",
    "Леонид",
    "Артемий",
    "Святослав",
    "Руслан",
    "Дамир",
    "Мария",
    "Анна",
    "Софья",
    "Анастасия",
    "Виктория",
    "Алиса",
    "Дарья",
    "Ксения",
    "Елизавета",
    "Полина",
    "Екатерина",
    "Александра",
    "Василиса",
    "Варвара",
    "Елена",
    "Арина",
    "Ульяна",
    "Вероника",
    "Валерия",
    "Ева",
    "Юлия",
    "Ольга",
    "Таисия",
    "Маргарита",
    "Милана",
    "Кира",
    "Диана",
    "Яна",
    "Мирослава",
    "Ирина",
    "Евгения",
    "Вера",
    "Олеся",
    "Ангелина",
    "Алина",
    "Кристина",
    "Эмилия",
    "Марианна",
    "Светлана",
    "Злата",
    "Амалия",
    "Карина",
    "Татьяна",
    "Дарина",
    "Надежда",
    "Ярослава",
    "Агата",
    "Ника",
    "Наталья",
    "Элина"
);

	if (isset($_POST['suggestions'])) {
		$name = $_POST['suggestions'];

    		if (!empty($name)) {
    			foreach ($existingNames as $existingName) {
    			$existingName = mb_strtolower($existingName);
    			if (strpos($existingName, $name) !== false) {
    				echo $existingName;
    				echo "</br>";
    			}

               /* foreach ($existingNames as $existingNameUp) {
                    if (strpos($existingNameUp, $name) !== false) {
                        echo $existingNameUp;
                        echo "</br>";
                    }
                }*/


    		}
		
        }
		
	}

?>